
&Перед("Печать")
Процедура Интерлинк_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Интерлинк_УпаковочныйЛистСписокДокументов.РасходнаяНакладная КАК РасходнаяНакладная
	|ИЗ
	|	Документ.Интерлинк_УпаковочныйЛист.СписокДокументов КАК Интерлинк_УпаковочныйЛистСписокДокументов
	|ГДЕ
	|	Интерлинк_УпаковочныйЛистСписокДокументов.Ссылка В(&МассивОбъектов)"
	;
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	МассивНакладных = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("РасходнаяНакладная");
	Если МассивНакладных.Количество() > 0 Тогда
		МассивОбъектов = МассивНакладных;
	КонецЕсли;

КонецПроцедуры
