
&Перед("ЗаполнитьПоЗаказуПокупателя")
Процедура Интерлинк_ЗаполнитьПоЗаказуПокупателя(ДанныеЗаполнения)
	// Основание и настройка документа.
	МассивЗаказов = Новый Массив;
	Если НЕ (ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("МассивЗаказовПокупателей")) Тогда
		МассивЗаказов.Добавить(ДанныеЗаполнения.Ссылка);

		// Заполнение шапки.
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказПокупателя.Ссылка КАК ОснованиеСсылка,
		|	ЗаказПокупателя.Проведен КАК ОснованиеПроведен,
		|	ЗаказПокупателя.Грузополучатель КАК Грузополучатель,
		|	ЗаказПокупателя.АдресДоставки КАК АдресДоставки
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.Ссылка В(&МассивЗаказов)";
		
		Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
		Запрос.УстановитьПараметр("ДатаДокумента", ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата()));
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда		
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
